content/posts-org/ddr_dev.org
#+hugo_base_dir: ../../
# -*- mode: org; coding: utf-8; -*-

* Header Information                                               :noexport:
#+LaTeX_CLASS_OPTIONS: [11pt]
#+LATEX_HEADER: \usepackage{helvetica}
#+LATEX_HEADER: \setlength{\textwidth}{5.1in} % set width of text portion
#+LATEX_HEADER: \usepackage{geometry}
#+TITLE:     Setup DDR development enviroment
#+AUTHOR:    Fei Ni
#+EMAIL:     feiphilips.ni@veritas.com
#+DATE:      2021-01-26
#+HUGO_CATEGORIES:
#+HUGO_tags: helix
#+hugo_auto_set_lastmod: t
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+OPTIONS:   ^:{}
#+INFOJS_OPT: view:nil toc:nil ltoc:nil mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+HTML_HEAD: <link rel="stylesheet" href="org.css" type="text/css"/>
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:
#+LINK_HOME:
#+XSLT:

#+STARTUP: hidestars

#+STARTUP: overview   (or: showall, content, showeverything)
http://orgmode.org/org.html#Visibility-cycling  info:org#Visibility cycling

#+TODO: TODO(t) NEXT(n) STARTED(s) WAITING(w@/!) SOMEDAY(S!) | DONE(d!/!) CANCELLED(c@/!)
http://orgmode.org/org.html#Per_002dfile-keywords  info:org#Per-file keywords

#+TAGS: important(i) private(p)
#+TAGS: @HOME(h) @OFFICE(o)
http://orgmode.org/org.html#Setting-tags  info:org#Setting tags

#+NOstartup: beamer
#+NOLaTeX_CLASS: beamer
#+NOLaTeX_CLASS_OPTIONS: [bigger]
#+NOBEAMER_FRAME_LEVEL: 2


# Start from here

* Background

  DDR(Data Delivery Review) is a internal work-flow website which is used to review the analysis report from the Helix platform by Helix tech reviewer manually.

* Related repos
  - https://github.com/myhelix/ddrui/
  - https://github.com/myhelix/ddr

* Setup the local development environment

** [[https://myhelix.atlassian.net/wiki/spaces/ENG/pages/31129602/Dev+Computer+Setup][General helix dev setup]]
** Setup and start the  backend
   - checkout the code from https://github.com/myhelix/ddr
   - hcd ddr
   - glide install
   - go install
   - go run main.go

** Start DB
    - rundeps (start the local db service)

** Initialize DB

  - Setup local DB variable and run data migration

    #+begin_src bash
      export DB_USER=root
      export DB_PASS=
      export DB_HOST=127.0.0.1
      export DB_PORT=3181
      dbauth migration goose --env test up
    #+end_src

  - Insert yourself into reviewerUsers table

  #+begin_src bash
    #enter mysql console
    docker exec -it docker_mysql-ddr_1 mysql ddr
    # insert yourself into reviewUsers table, so that you can login in at the first place
    mysql> insert into reviewUsers (userId, userRoles, isActive) values ('ross.blanchard@helix.com', 'CLS,LabDirector,Expert,Admin', true)
  #+end_src

** Setup and start front-end
   - Install required packages
      - brew install node yarn flow
   - checkout the code from https://github.com/myhelix/ddrui/
   - hcd ddrui
   - yarn
   - yarn dev (It will open a browser and show the login page)

* client Ids
| Env        | google_client_id                                                         |
| staging    | 581178163594-2gdjneq9sbcc71gcuaesk4akgfd6d7qv.apps.googleusercontent.com |
| test       | 581178163594-6rgulcirk2grvv5bbl0t5j9sq2lsvif6.apps.googleusercontent.com |
| production | 581178163594-s1lsfae3r1uca003pq4egdoukr8v0ba6.apps.googleusercontent.com |
